# =============================================================================
# Brewfile - dotfiles essential packages
# Usage: brew bundle --global
# =============================================================================

# --- Taps ---
tap "daipeihust/tap"
tap "felixkratz/formulae"
tap "laishulu/homebrew"
tap "nikitabobko/tap"

# --- Modern CLI ---
brew "bat"               # cat with syntax highlighting
brew "eza"               # Modern ls
brew "fd"                # Modern find
brew "fzf"               # Fuzzy finder
brew "git-delta"         # Git diff pager
brew "jq"                # JSON processor
brew "ripgrep"           # Modern grep
brew "tree"              # Directory tree
brew "yq"                # YAML/JSON/XML processor
brew "zoxide"            # Smarter cd

# --- Shell & Terminal ---
brew "atuin"             # Shell history
brew "sesh"              # Terminal session manager
brew "stow"              # Symlink manager
brew "tmux"              # Terminal multiplexer
brew "yazi"              # Terminal file manager
brew "zsh-autocomplete"  # Zsh completion

# --- Dev Tools ---
brew "gh"                # GitHub CLI
brew "jj"                # Jujutsu VCS
brew "neovim"            # Editor
brew "shellcheck"        # Shell linter
brew "shfmt"             # Shell formatter
brew "tree-sitter-cli"   # nvim-treesitter parser compiler

# --- macOS Workflow ---
brew "daipeihust/tap/im-select"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "laishulu/homebrew/macism"

# --- Cask Apps ---
cask "1password-cli"
cask "ghostty"
cask "nikitabobko/tap/aerospace"
cask "raycast"

# --- Fonts ---
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-sketchybar-app-font"
